# Clock constraints
create_clock -name "clock_50" -period 20.000ns [get_ports {clock_50}]

# Automatically constrain PLL and other generated clocks
derive_pll_clocks -create_base_clocks

# Clocks generated by a synchronous counter
# nb. 25e6 divider is too big
create_generated_clock -name 1s_clk -divide_by 25000 -source [get_ports clock_50]  gene_clk:gene_clkl|clk_1s
create_generated_clock -name 1M_clk -divide_by 16   -source [get_ports clock_50]  gene_clk:gene_clkl|clk_1M

create_generated_clock -name AUD_clk -divide_by 4   -source [get_ports clock_50]  codec:codec|clk_12

set_false_path -from [ get_clocks 1M_clk ] -to [ get_clocks clock_50 ]
set_false_path -from [ get_clocks clock_50 ] -to [ get_clocks 1M_clk ]

# tsu
set_max_delay -from [all_inputs] -to [get_registers *] 5.000ns

# tco
set_max_delay -from [get_registers *] -to [all_outputs] 15.000ns

#tpd
set_max_delay -from [all_inputs] -to [all_outputs] 15.000ns

# th
#set_input_delay -clock virt_clk50 -min -1.5ns [all_inputs]

# tco constraints
#set_output_delay -clock "clock_50" -max 18ns [get_ports {*}] 
#set_output_delay -clock "clock_50" -min -1.000ns [get_ports {*}] 


# tpd constraints
#set_max_delay 20.000ns -from [get_ports {*}] -to [get_ports {*}]
#set_min_delay 1.000ns -from [get_ports {*}] -to [get_ports {*}]

# Remove async reset checking
set_false_path -from [get_registers {gene_reset:gene_reset|R[1]]}] -to [get_registers *]

